In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [15]:
mrt_df = pd.read_json("cleaned-data/mrt_data.json")
mrt_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26562 entries, 0 to 26561
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          26562 non-null  datetime64[ns]
 1   time          26562 non-null  object
 2   North Ave     26558 non-null  float64
 3   Quezon Ave    26562 non-null  int64
 4   GMA Kamuning  26562 non-null  int64
 5   Cubao         26562 non-null  int64
 6   Santolan      26562 non-null  int64
 7   Ortigas       26433 non-null  float64
 8   Shaw Blvd     26562 non-null  int64
 9   Boni Ave      26562 non-null  int64
 10  Guadalupe     26294 non-null  float64
 11  Buendia       26548 non-null  float64
 12  Ayala Ave     26560 non-null  float64
 13  Magallanes    26562 non-null  int64
 14  Taft          26560 non-null  float64
dtypes: datetime64[ns](1), float64(6), int64(7), object(1)
memory usage: 3.0+ MB

In [16]:
mrt_df["hour"] = mrt_df.time.apply(lambda x: x.split("-")[0])
mrt_df["date"] = mrt_df["date"].astype("str")
mrt_df["datetime"] = pd.to_datetime(mrt_df.date + " " + mrt_df.hour)
mrt_df.head()

,date,time,North Ave,Quezon Ave,GMA Kamuning,Cubao,Santolan,Ortigas,Shaw Blvd,Boni Ave,Guadalupe,Buendia,Ayala Ave,Magallanes,Taft,hour,datetime
0,2019-01-01,06:00 - 06:59,376.0,152,72,239,15,36.0,180,74,95.0,53.0,181.0,186,392.0,06:00,2019-01-01 06:00:00
1,2019-01-01,07:00 - 07:59,471.0,214,75,413,17,68.0,260,173,203.0,96.0,333.0,278,651.0,07:00,2019-01-01 07:00:00
2,2019-01-01,08:00 - 08:59,675.0,236,117,454,21,64.0,330,150,292.0,77.0,237.0,223,776.0,08:00,2019-01-01 08:00:00
3,2019-01-01,09:00 - 09:59,971.0,257,134,640,41,59.0,407,179,372.0,52.0,243.0,216,997.0,09:00,2019-01-01 09:00:00
4,2019-01-01,10:00 - 10:59,1575.0,463,200,866,48,82.0,503,310,528.0,61.0,188.0,282,1505.0,10:00,2019-01-01 10:00:00

In [17]:
mrt_df.columns = mrt_df.columns.str.lower()
mrt_df.columns = mrt_df.columns.str.replace(" ", "_", regex=True)
mrt_df = mrt_df.set_index("datetime", drop=True).sort_index()
mrt_df.head()

,date,time,north_ave,quezon_ave,gma_kamuning,cubao,santolan,ortigas,shaw_blvd,boni_ave,guadalupe,buendia,ayala_ave,magallanes,taft,hour
datetime,,,,,,,,,,,,,,,,
2019-01-01 00:00:00,2019-01-01,00:00 - 00:59,0.0,0,0,0,0,0.0,0,0,0.0,0.0,0.0,0,0.0,00:00
2019-01-01 06:00:00,2019-01-01,06:00 - 06:59,376.0,152,72,239,15,36.0,180,74,95.0,53.0,181.0,186,392.0,06:00
2019-01-01 07:00:00,2019-01-01,07:00 - 07:59,471.0,214,75,413,17,68.0,260,173,203.0,96.0,333.0,278,651.0,07:00
2019-01-01 08:00:00,2019-01-01,08:00 - 08:59,675.0,236,117,454,21,64.0,330,150,292.0,77.0,237.0,223,776.0,08:00
2019-01-01 09:00:00,2019-01-01,09:00 - 09:59,971.0,257,134,640,41,59.0,407,179,372.0,52.0,243.0,216,997.0,09:00

In [18]:
mrt_df = mrt_df.drop(columns=["date","time", "hour"])
mrt_df.head()

,north_ave,quezon_ave,gma_kamuning,cubao,santolan,ortigas,shaw_blvd,boni_ave,guadalupe,buendia,ayala_ave,magallanes,taft
datetime,,,,,,,,,,,,,
2019-01-01 00:00:00,0.0,0,0,0,0,0.0,0,0,0.0,0.0,0.0,0,0.0
2019-01-01 06:00:00,376.0,152,72,239,15,36.0,180,74,95.0,53.0,181.0,186,392.0
2019-01-01 07:00:00,471.0,214,75,413,17,68.0,260,173,203.0,96.0,333.0,278,651.0
2019-01-01 08:00:00,675.0,236,117,454,21,64.0,330,150,292.0,77.0,237.0,223,776.0
2019-01-01 09:00:00,971.0,257,134,640,41,59.0,407,179,372.0,52.0,243.0,216,997.0